yooaroma/yoo_stm8s/src/BEEP/stm8s_beep_main.c
	/* Configure PD0 (LED1) as output push-pull low (led switched on) */
	// GPIO_Init(UCOM_LED1_GPIO, UCOM_LED1_PIN, UCOM_LED1_MODE);
	{
		UCOM_LED1_GPIO->DDR |= (UCOM_LED1_PIN);	 /* Set Output mode */
		UCOM_LED1_GPIO->CR1 |= (UCOM_LED1_PIN);	 /* Pull-Up or Push-Pull */
		UCOM_LED1_GPIO->CR2 |= (UCOM_LED1_PIN);	 /* Output speed up to 10 MHz */
		UCOM_LED1_GPIO->ODR &= ~(UCOM_LED1_PIN); // low...
	}
	/* Configure PA3 : KEY IN as input push-pull low (led switched on) */
	// GPIO_Init(UCOM_KEY1_GPIO, UCOM_KEY1_PIN, UCOM_KEY1_MODE);
	{
		UCOM_KEY1_GPIO->DDR &= ~(UCOM_KEY1_PIN); /* Set input mode */
		UCOM_KEY1_GPIO->CR1 |= (UCOM_KEY1_PIN);	 /* Pull-Up or Push-Pull */
		UCOM_KEY1_GPIO->CR2 &= ~(UCOM_KEY1_PIN); /*  External interrupt disabled */
	}
	/* Configure PD4 (BEEPER) as output push-pull low */
	// GPIO_Init(GPIOD, GPIO_PIN_4 , GPIO_MODE_OUT_PP_LOW_FAST);
	// PD4 : BEEP
	/* Configure PD4 (BEEP) as output push-pull low (led switched on) */
	// GPIO_Init(UCOM_BEEP_GPIO, UCOM_BEEP_PIN, UCOM_BEEP_MODE);
	{
		UCOM_BEEP_GPIO->DDR |= (UCOM_BEEP_PIN);	 /* Set Output mode */
		UCOM_BEEP_GPIO->CR1 |= (UCOM_BEEP_PIN);	 /* Pull-Up or Push-Pull */
		UCOM_BEEP_GPIO->CR2 |= (UCOM_BEEP_PIN);	 /* Output speed up to 10 MHz */
		UCOM_BEEP_GPIO->ODR &= ~(UCOM_BEEP_PIN); // low...
	}
}
//----------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------
void calConfigBEEP_test(uint16_t vwFreq) // msec...
{
	uint8_t vbBEEPSEL = 0;
	uint8_t vbBEEPDIV = 0;
	uint32_t vdwData = vwFreq;
	uint32_t vdwDataLast = 0;
	uint8_t vdwDiv = 0;
	if (vwFreq < 500)
	{
		// error...
		vbBEEPSEL = 0xFF;
	}
	else if (vwFreq < 1000)
	{
		vbBEEPSEL = 0x00; // f / (8 * div) khz
		vdwDiv = (128000 / 8) / vdwData;
		vbBEEPDIV = vdwDiv - 2;
		vdwDataLast = (128000 / 8) / vdwDiv;
	}
	else if (vwFreq < 2000)
	{
		vbBEEPSEL = 0x01; // f / (4 * div) khz
		vdwDiv = (128000 / 4) / vdwData;
		vbBEEPDIV = vdwDiv - 2;
		vdwDataLast = (128000 / 8) / vdwDiv;
	}
	else if (vwFreq < 32000)
	{
		vbBEEPSEL = 0x02; // f / (2 * div) khz
		vdwDiv = (128000 / 2) / vdwData;
		vbBEEPDIV = vdwDiv - 2;
		vdwDataLast = (128000 / 8) / vdwDiv;
	}
	else
	{
		// error...
		vbBEEPSEL = 0xFF;
	}
	if (vbBEEPSEL != 0xFF)
	{
		ccprintf(_DEBUG_CMD_A_, ("beep init [%d : SEL(%d) : DIV(%d)] Hz\r\n", vwFreq, vbBEEPSEL, vbBEEPDIV));
		/* Set a default calibration value if no calibration is done */
		// if ((BEEP->CSR & BEEP_CSR_BEEPDIV) == BEEP_CSR_BEEPDIV)
		BEEP->CSR = BEEP_CSR_BEEPDIV;
		{
			BEEP->CSR &= (uint8_t)(~BEEP_CSR_BEEPDIV); /* Clear bits */
			BEEP->CSR |= (vbBEEPDIV & BEEP_CSR_BEEPDIV);
		}
		{
			/* Select the output frequency */
			BEEP->CSR &= (uint8_t)(~BEEP_CSR_BEEPSEL);
			BEEP->CSR |= (uint8_t)((vbBEEPSEL & 0x03) << 6);
		}
	}
	else
	{
		BEEP->CSR = BEEP_CSR_BEEPDIV;
		ccprintf(_DEBUG_CMD_A_, ("beep init error... [%d] Hz\r\n", vwFreq));
	}
}
//----------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------
/**
 * @brief Delay.
 * @param[in] nCount
 * @retval
 * None
 */
void Delay(u16 nCount)
{
	/* Decrement nCount value */
	while (nCount != 0)
	{
		nCount--;
	}
}
//----------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------
#endif // __MIB_DEBUG_AWU__
//----------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------
/*
https://www.st.com/resource/en/reference_manual/rm0016-stm8s-series-and-stm8af-series-8bit-microcontrollers-stmicroelectronics.pdf

12 Auto-wakeup (AWU)
12.1 AWU introduction
The AWU is used to provide an internal wakeup time base that is used when the MCU goes
into Active-halt power saving mode. This time base is clocked by the low speed internal
(LSI) RC oscillator clock or the HSE crystal oscillator clock divided by a prescaler.

10.2 Low power modes
Table 20. Low power mode management

Mode (consumption level)        Main voltage regulator           Oscillators      CPU     Peripherals          Wakeup trigger event

Wait                                                                                                           All internal interrupts
( - )                              On                              On             Off        On(1)             (including AWU) or external interrupts, reset

Active-halt
( - - )                           On                     Off except LSI (or HSE)   Off       Only AWU(2)         AWU or external(3)  interrupts, reset

Active-halt with         Off (low power regulator on)   Off except LSI only       Off        Only AWU(2)         AWU or external(3) interrupts, reset
MVR auto power off
( - - - )

Halt                    Off (low power regulator on)    Off                        Off         Off(2)              External(3) interrupts, reset
( - - - - )

1. If the peripheral clock is not disabled by peripheral clock gating function.
2. If activated, BEEP or IWDG stay switched on. In this case, the LSI clock is forced to run.
3. Including communication peripheral interrupts.

OPTION bit reset value :  PRSC[1:0] = 0, CKAWUSEL = 0
HSE clock to 128 kHz LS clock

APR[5:0]
AWUTB[3:0]
AWUF   :  AWUF: Auto-wakeup flag
AWUEN  :  AWUEN: Auto-wakeup enable

12.4.1 Control/status register (AWU_CSR)
Address offset: 0x00
Reset value: 0x00

76543210
Reserved AWUF AWUEN Reserved MSR
r rc_r rw r rw
Bits 7:6 Reserved
Bit 5 AWUF: Auto-wakeup flag
This bit is set by hardware when the AWU module generates an interrupt and cleared by reading the
AWU_CSR register. Writing to this bit does not change its value.
0: No AWU interrupt occurred
1: AWU interrupt occurred
Bit 4 AWUEN: Auto-wakeup enable
This bit is set and cleared by software. It enables the auto-wakeup feature. If the microcontroller enters
Active-halt or Wait mode, the AWU feature wakes up the microcontroller after a programmable time
delay.
0: AWU (Auto-wakeup) disabled
1: AWU (Auto-wakeup) enabled
Bits 3:1 Reserved
Bit 0 MSR: Measurement enable
This bit connects the fLS clock to a timer input capture. This allows the timer to be used to measure the
LS frequency (fLS).
0: Measurement disabled
1: Measurement enabled
Note: Refer to the datasheet for information on which timer input capture can be connected to the LSI
clock in the specific product).


12.4.2 Asynchronous prescaler register (AWU_APR)
Address offset: 0x01
Reset value: 0x3F

76543210
Reserved APR[5:0]
r rw
Bits 7:6 Reserved
Bits 5:0 APR[5:0]: Asynchronous prescaler divider
These bits are written by software to select the prescaler divider (APRDIV) feeding the counter clock.
0x00: APRDIV = 2 0x0E: APRDIV = 16
0x01: APRDIV = 3 0x0F: APRDIV = 17
... ...
0x06: APRDIV = 8 0x3E: APRDIV = 64
Note: This register must not be kept at its reset value (0x3F)



12.4.3 Timebase selection register (AWU_TBR)
Address offset: 0x02
Reset value: 0x00

76543210
Reserved AWUTB[3:0]
r rw
Bits 7:4 Reserved
Bits 3:0 AWUTB[3:0]: Auto-wakeup timebase selection
These bits are written by software to define the time interval between AWU interrupts. AWU
interrupts are enabled when AWUEN = 1.
0000: No interrupt
0001: APRDIV/fLS 0010: 2xAPRDIV/fLS 0011: 22APRDIV/fLS
0100: 23APRDIV/fLS 0101: 24APRDIV/fLS 0110: 25APRDIV/fLS
0111: 26APRDIV/fLS 1000: 27APRDIV/fLS 1001: 28APRDIV/fLS
1010: 29APRDIV/fLS 1011: 210APRDIV/fLS 1100: 211APRDIV/fLS
1101: 212APRDIV/fLS 1110: 5x211APRDIV/fLS 1111: 30x211APRDIV/fLS

*/
//----------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------
